STMicroelectronics/STM32CubeWL/Projects/NUCLEO-WL55JC/Applications/Sigfox/Sigfox_AT_Slave/Sigfox/App/sgfx_at.c
  /*Send Bytes to Sigfox Network */
  if (dlFlag == 0)
  {
    error = SIGFOX_API_send_frame(ul_msg, ul_size, dl_msg, txRepeat, SFX_FALSE);
    if (error != SFX_ERR_NONE)
    {
      if (error == SFX_ERR_INT_PROCESS_UPLINK_CS_TIMEOUT)
      {
        return AT_TX_TIMEOUT;
      }
      else
      {
        APP_LOG(TS_OFF, VLEVEL_H, "ERROR 0x%04X\r\n", error);
        return AT_LIB_ERROR;
      }
    }
  }
  else
  {
    error = SIGFOX_API_send_frame(ul_msg, ul_size, dl_msg, txRepeat, SFX_TRUE);

    if (error == SFX_ERR_NONE)
    {
      print_rx(dl_msg, SGFX_MAX_DL_PAYLOAD_SIZE * 2);
    }
    else if (error == SFX_ERR_INT_GET_RECEIVED_FRAMES_TIMEOUT)
    {
      return AT_RX_TIMEOUT;
    }
    else
    {
      APP_LOG(TS_OFF, VLEVEL_H, "ERROR 0x%04X\r\n", error);
      return AT_LIB_ERROR;
    }
  }
  return AT_OK;
  /* USER CODE BEGIN AT_SendFrame_2 */

  /* USER CODE END AT_SendFrame_2 */
}

ATEerror_t AT_SendHexFrame(const char *param)
{
  /* USER CODE BEGIN AT_SendHexFrame_1 */

  /* USER CODE END AT_SendHexFrame_1 */
  uint8_t ul_msg[SGFX_MAX_UL_PAYLOAD_SIZE] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
  uint8_t dl_msg[SGFX_MAX_DL_PAYLOAD_SIZE] = {0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00};
  uint32_t dlFlag = 0;   /* default */
  uint32_t  ul_size = 0;
  uint32_t nbParam;
  uint32_t txRepeat = 1;
  sfx_error_t error;

  /* convert AT param to sgfx param */
  /* ul_size, ul_msg[ul_size], dlFlag, txRepeat*/

  tiny_sscanf(param, "%u", &ul_size);

  if (ul_size > SGFX_MAX_UL_PAYLOAD_SIZE)
  {
    return AT_PARAM_ERROR;
  }
  param += 2;

  for (int32_t i = 0; i < ul_size; i++)
  {
    ul_msg[i] = param[i];
  }

  if (param[ul_size] == ',')
  {
    nbParam = tiny_sscanf(&param[ul_size + 1], "%u,%u", &dlFlag, &txRepeat);

    if (nbParam > 2)
    {
      return AT_PARAM_ERROR;
    }
  }

  /*Send Bytes to Sigfox Network */
  if (dlFlag == 0)
  {
    error = SIGFOX_API_send_frame(ul_msg, ul_size, dl_msg, txRepeat, SFX_FALSE);
    if (error != SFX_ERR_NONE)
    {
      if (error == SFX_ERR_INT_PROCESS_UPLINK_CS_TIMEOUT)
      {
        return AT_TX_TIMEOUT;
      }
      else
      {
        APP_LOG(TS_OFF, VLEVEL_H, "ERROR 0x%04X\r\n", error);
        return AT_LIB_ERROR;
      }
    }
  }
  else
  {
    error = SIGFOX_API_send_frame(ul_msg, ul_size, dl_msg, txRepeat, SFX_TRUE);

    if (error == SFX_ERR_NONE)
    {
      print_rx(dl_msg, SGFX_MAX_DL_PAYLOAD_SIZE * 2);
    }
    else if (error == SFX_ERR_INT_GET_RECEIVED_FRAMES_TIMEOUT)
    {
      return AT_RX_TIMEOUT;
    }
    else
    {
      APP_LOG(TS_OFF, VLEVEL_H, "ERROR 0x%04X\r\n", error);
      return AT_LIB_ERROR;
    }
  }
  return AT_OK;
  /* USER CODE BEGIN AT_SendHexFrame_2 */

  /* USER CODE END AT_SendHexFrame_2 */
}

ATEerror_t AT_version_get(const char *param)
{
  /* USER CODE BEGIN AT_version_get_1 */

  /* USER CODE END AT_version_get_1 */
  sfx_u8 *version;
  sfx_u8 size;

  SIGFOX_API_get_version(&version, &size, VERSION_SIGFOX);
  print_n(version, size);
  AT_PRINTF("\r\n");

  SIGFOX_API_get_version(&version, &size, VERSION_RF);
  print_n(version, size);
  AT_PRINTF("\r\n");

  SIGFOX_API_get_version(&version, &size, VERSION_MCU);
  print_n(version, size);
  AT_PRINTF("\r\n");

  SIGFOX_API_get_version(&version, &size, VERSION_SE);
  print_n(version, size);
  AT_PRINTF("\r\n");

  SIGFOX_API_get_version(&version, &size, VERSION_MONARCH);
  print_n(version, size);
  AT_PRINTF("\r\n");

  AT_PPRINTF("APP_VERSION: STM32Cube_FW_WL_V%X.%X.%X\r\n", __APP_VERSION_MAIN,
             __APP_VERSION_SUB1,
             __APP_VERSION_SUB2);

  return AT_OK;
  /* USER CODE BEGIN AT_version_get_2 */

  /* USER CODE END AT_version_get_2 */
}

ATEerror_t AT_DevPac_get(const char *param)
{
  /* USER CODE BEGIN AT_DevPac_get_1 */

  /* USER CODE END AT_DevPac_get_1 */
  sfx_u8 SfxPac[PAC_LENGTH];

  sfx_error_t error;

  error = SIGFOX_API_get_initial_pac(SfxPac);

  if (error != SFX_ERR_NONE)
  {
    return AT_LIB_ERROR;
  }

  for (int32_t i = 0; i < PAC_LENGTH; i++)
  {
    AT_PRINTF("%02X", SfxPac[i]);
  }
  AT_PRINTF("\r\n");
  return AT_OK;
  /* USER CODE BEGIN AT_DevPac_get_2 */

  /* USER CODE END AT_DevPac_get_2 */
}

ATEerror_t AT_DevId_get(const char *param)
{
  /* USER CODE BEGIN AT_DevId_get_1 */

  /* USER CODE END AT_DevId_get_1 */
  sfx_u8 SfxId[ID_LENGTH];

  sfx_error_t error;

  error = SIGFOX_API_get_device_id(SfxId);

  if (error != SFX_ERR_NONE)
  {
    return AT_LIB_ERROR;
  }
  for (int32_t i = ID_LENGTH; i > 0; i--)
  {
    AT_PRINTF("%02X", SfxId[i - 1]);
  }
  AT_PRINTF("\r\n");
  return AT_OK;
  /* USER CODE BEGIN AT_DevId_get_2 */

  /* USER CODE END AT_DevId_get_2 */
}

ATEerror_t AT_PublicKey_set(const char *param)
{
  /* USER CODE BEGIN AT_PublicKey_set_1 */

  /* USER CODE END AT_PublicKey_set_1 */
  if ((param[0] == '0') && (param[1] == '\0'))
  {
    E2P_Write_KeyType(CREDENTIALS_KEY_PRIVATE);
  }
  else if ((param[0] == '1') && (param[1] == '\0'))
  {
    E2P_Write_KeyType(CREDENTIALS_KEY_PUBLIC);
  }
  else
  {
    return AT_PARAM_ERROR;
  }

  return AT_OK;
  /* USER CODE BEGIN AT_PublicKey_set_2 */

  /* USER CODE END AT_PublicKey_set_2 */
}

ATEerror_t AT_PublicKey_get(const char *param)
{
  /* USER CODE BEGIN AT_PublicKey_get_1 */

  /* USER CODE END AT_PublicKey_get_1 */
  AT_PRINTF("%d\r\n", (uint8_t) E2P_Read_KeyType());

  return AT_OK;
  /* USER CODE BEGIN AT_PublicKey_get_2 */

  /* USER CODE END AT_PublicKey_get_2 */
}

ATEerror_t AT_PayloadEncryption_set(const char *param)
{
  /* USER CODE BEGIN AT_PayloadEncryption_set_1 */

  /* USER CODE END AT_PayloadEncryption_set_1 */
  if ((param[0] == '0') && (param[1] == '\0'))
  {
    E2P_Write_EncryptionFlag(0);
  }
  else if ((param[0] == '1') && (param[1] == '\0'))
  {
    E2P_Write_EncryptionFlag(1);
  }
  else
  {
    return AT_PARAM_ERROR;
  }

  return AT_OK;
  /* USER CODE BEGIN AT_PayloadEncryption_set_2 */

  /* USER CODE END AT_PayloadEncryption_set_2 */
}

ATEerror_t AT_PayloadEncryption_get(const char *param)
{
  /* USER CODE BEGIN AT_PayloadEncryption_get_1 */

