STMicroelectronics/STM32CubeWL/Projects/NUCLEO-WL55JC/Applications/Sigfox/Sigfox_AT_Slave/Sigfox/App/sgfx_at.c
  /* USER CODE END AT_PayloadEncryption_get_1 */
  AT_PRINTF("%d\r\n", (uint8_t) E2P_Read_EncryptionFlag());

  return AT_OK;
  /* USER CODE BEGIN AT_PayloadEncryption_get_2 */

  /* USER CODE END AT_PayloadEncryption_get_2 */
}

ATEerror_t AT_bat_get(const char *param)
{
  /* USER CODE BEGIN AT_bat_get_1 */

  /* USER CODE END AT_bat_get_1 */
  print_u(SYS_GetBatteryLevel());
  return AT_OK;
  /* USER CODE BEGIN AT_bat_get_2 */

  /* USER CODE END AT_bat_get_2 */
}

ATEerror_t AT_test_cw(const char *param)
{
  /* USER CODE BEGIN AT_test_cw_1 */

  /* USER CODE END AT_test_cw_1 */
  uint32_t freq = 0;

  if (tiny_sscanf(param, "%u", &freq) > 1)
  {
    return AT_PARAM_ERROR;
  }

  if (freq == 0)
  {
    sfx_rc_enum_t sfx_rc = E2P_Read_Rc();

    sfx_u32 config_words[3] = {0};

    E2P_Read_ConfigWords(sfx_rc, config_words);

    SIGFOX_API_stop_continuous_transmission();
    /*reopen after test*/
    if (SIGFOX_reopen_and_reconf(sfx_rc, config_words) != SFX_ERR_NONE)
    {
      return AT_RECONF_ERROR;
    }
  }
  else if ((freq > ((uint32_t) 100e6)) && (freq < ((uint32_t) 1e9)))
  {
    SIGFOX_API_close();
    if (SIGFOX_API_start_continuous_transmission(freq, SFX_NO_MODULATION) != SFX_ERR_NONE)
    {
      return AT_PARAM_ERROR;
    }
  }
  else if ((freq >  100) && (freq <  1000))
  {
    /* user meant Mega... */
    SIGFOX_API_close();
    if (SIGFOX_API_start_continuous_transmission(freq * 1000000, SFX_NO_MODULATION) != SFX_ERR_NONE)
    {
      return AT_PARAM_ERROR;
    }
  }
  else
  {
    return AT_PARAM_ERROR;
  }

  return AT_OK;
  /* USER CODE BEGIN AT_test_cw_2 */

  /* USER CODE END AT_test_cw_2 */
}

ATEerror_t AT_test_pn(const char *param)
{
  /* USER CODE BEGIN AT_test_pn_1 */

  /* USER CODE END AT_test_pn_1 */
  uint32_t freq = 0;
  uint32_t bitrate = 0;
  sfx_modulation_type_t sfx_bitrate = SFX_DBPSK_100BPS;

  if (tiny_sscanf(param, "%u,%u", &freq, &bitrate) > 2)
  {
    return AT_PARAM_ERROR;
  }

  if (bitrate == 100)
  {
    sfx_bitrate = SFX_DBPSK_100BPS;
  }
  else if (bitrate == 600)
  {
    sfx_bitrate = SFX_DBPSK_600BPS;
  }
  else if (bitrate == 0)
  {
    if (freq != 0)
    {
      return AT_PARAM_ERROR;
    }
  }
  else
  {
    return AT_PARAM_ERROR;
  }

  if (freq == 0)
  {
    sfx_rc_enum_t sfx_rc = E2P_Read_Rc();

    sfx_u32 config_words[3] = {0};

    E2P_Read_ConfigWords(sfx_rc, config_words);

    SIGFOX_API_stop_continuous_transmission();
    /*reopen after test*/
    if (SIGFOX_reopen_and_reconf(sfx_rc, config_words) != SFX_ERR_NONE)
    {
      return AT_RECONF_ERROR;
    }
  }
  else if ((freq > ((uint32_t) 100e6)) && (freq < ((uint32_t) 1e9)))
  {
    SIGFOX_API_close();
    if (SIGFOX_API_start_continuous_transmission(freq, sfx_bitrate) != SFX_ERR_NONE)
    {
      return AT_PARAM_ERROR;
    }
  }
  else if ((freq >  100) && (freq <  1000))
  {
    /* user meant Mega... */
    SIGFOX_API_close();
    if (SIGFOX_API_start_continuous_transmission(freq * 1000000, sfx_bitrate) != SFX_ERR_NONE)
    {
      return AT_PARAM_ERROR;
    }
  }
  else
  {
    return AT_PARAM_ERROR;
  }

  return AT_OK;
  /* USER CODE BEGIN AT_test_pn_2 */

  /* USER CODE END AT_test_pn_2 */
}

ATEerror_t AT_scan_mn(const char *param)
{
  /* USER CODE BEGIN AT_scan_mn_1 */

  /* USER CODE END AT_scan_mn_1 */
#ifdef MN_ON
  ATEerror_t at_status = AT_OK;

  sfx_u8 rc_capabilities_bit_mask = 0x7F; /*all RCs from RC1 to RC7*/
  sfx_u16 timer = 5;

  sfx_rc_enum_t sfx_rc = E2P_Read_Rc();

  sfx_u32 config_words[3] = {0};

  E2P_Read_ConfigWords(sfx_rc, config_words);

  if (tiny_sscanf(param, "%u", &timer) > 1)
  {
    return AT_PARAM_ERROR;
  }
  SIGFOX_API_close();

  SIGFOX_MONARCH_API_execute_rc_scan(rc_capabilities_bit_mask, timer, SFX_TIME_S, app_callback_handler);

  UTIL_SEQ_WaitEvt(1 << CFG_SEQ_Evt_Monarch);

  if (SIGFOX_reopen_and_reconf(sfx_rc, config_words) != SFX_ERR_NONE)
  {
    at_status = AT_RECONF_ERROR;
  }

  return at_status;
#else
  return AT_ERROR;
#endif /* MN_ON */
  /* USER CODE BEGIN AT_scan_mn_2 */

  /* USER CODE END AT_scan_mn_2 */
}

#ifdef MN_ON
static sfx_u8 app_callback_handler(sfx_u8 rc_bit_mask, sfx_s16 rssi)
{
  /* USER CODE BEGIN app_callback_handler_1 */

  /* USER CODE END app_callback_handler_1 */
  switch (rc_bit_mask)
  {
    case 0:
    {
      AT_PRINTF("NO RC found\r\n");
      break;
    }
    case (1<<SFX_BITFIELD_SHIFT_RC1):
    {
      AT_PRINTF("RC 1 found\r\n");
      break;
    }
    case (1<<SFX_BITFIELD_SHIFT_RC2):
    {
      AT_PRINTF("RC 2 found\r\n");
      break;
    }
    case (1<<SFX_BITFIELD_SHIFT_RC3):
    {
      AT_PRINTF("RC 3 found\r\n");
      break;
    }
    case (1<<SFX_BITFIELD_SHIFT_RC4):
    {
      AT_PRINTF("RC 4 found\r\n");
      break;
    }
    case (1<<SFX_BITFIELD_SHIFT_RC5):
    {
      AT_PRINTF("RC 5 found\r\n");
      break;
    }
    case (1<<SFX_BITFIELD_SHIFT_RC6):
    {
      AT_PRINTF("RC 6 found\r\n");
      break;
    }
    case (1<<SFX_BITFIELD_SHIFT_RC7):
    {
      AT_PRINTF("RC 7 found\r\n");
      break;
    }
    default:
      AT_PRINTF("RC %d found\r\n", rc_bit_mask);
      break;
  }

  UTIL_SEQ_SetEvt(1 << CFG_SEQ_Evt_Monarch);

  return SFX_ERR_NONE;
  /* USER CODE BEGIN app_callback_handler_2 */

  /* USER CODE END app_callback_handler_2 */
}

static void sfx_monarch_test_mode_wait_start_cb(void)
{
  UTIL_SEQ_WaitEvt(1 << CFG_SEQ_Evt_Monarch);

}

static void sfx_monarch_test_mode_wait_end_cb(void)
{
  UTIL_SEQ_SetEvt(1 << CFG_SEQ_Evt_Monarch);
}
#endif /* MN_ON */

ATEerror_t AT_test_mode(const char *param)
{
  /* USER CODE BEGIN AT_test_mode_1 */

  /* USER CODE END AT_test_mode_1 */
  char test_mode;
  sfx_test_mode_t tm;
  sfx_rc_enum_t rc = SFX_RC1;
  sfx_error_t sfx_error;
#ifdef MN_ON
  sfx_u8 rc_capabilities_bit_mask = 0x7F;
#endif /* MN_ON */
  sfx_u32 config_words_restore[3] = {0};

  sfx_rc_enum_t rc_enum_restore = E2P_Read_Rc();

  ATEerror_t at_status = AT_OK;

  if ((param[0] == '1') && (param[1] == ','))
  {
    rc = SFX_RC1;
    param += 2;
  }
  else if ((param[0] == '2') && (param[1] == ','))
  {
    rc = SFX_RC2;
    param += 2;
  }
  else if ((param[0] == '3') && (param[2] == ','))
  {
    if ((param[1] == 'A') || (param[1] == 'a'))
    {
      rc = SFX_RC3A;
      param += 3;
    }
    else if ((param[1] == 'C') || (param[1] == 'c'))
    {
      rc = SFX_RC3C;
      param += 3;
    }
    else
    {
      return AT_PARAM_ERROR;
    }
  }
  else if ((param[0] == '4') && (param[1] == ','))
  {
    rc = SFX_RC4;
    param += 2;
  }
  else if ((param[0] == '5') && (param[1] == ','))
  {
    rc = SFX_RC5;
    param += 2;
  }
  else if ((param[0] == '6') && (param[1] == ','))
  {
    rc = SFX_RC6;
    param += 2;
  }
  else if ((param[0] == '7') && (param[1] == ','))
  {
    rc = SFX_RC7;
    param += 2;
  }
  else
  {
    return AT_PARAM_ERROR;
  }

