STMicroelectronics/STM32CubeWL/Projects/NUCLEO-WL55JC/Applications/Sigfox/Sigfox_AT_Slave/Sigfox/App/sgfx_at.c
  tiny_sscanf(param, "%u", &test_mode);

  if (test_mode < 14)
  {
    tm = (sfx_test_mode_t)(test_mode);
  }
  else
  {
    return AT_PARAM_ERROR;
  }

  SIGFOX_API_close();
  /*rc not propagated to mcu_delay. Set it now*/
  E2P_Write_Rc(rc);

  if ((test_mode >= 7) && (test_mode <= 10))
  {
#ifdef MN_ON
    sfx_error = ST_ADDON_SIGFOX_RF_PROTOCOL_API_monarch_test_mode_async(rc, tm, rc_capabilities_bit_mask,
                                                                        sfx_monarch_test_mode_wait_start_cb,
                                                                        sfx_monarch_test_mode_wait_end_cb);
#else
    at_status = AT_ERROR;
#endif /* MN_ON */
  }
  else if (test_mode == 12)
  {
    sfx_error = testmode_12(rc);
  }
  else
  {
    sfx_error = ADDON_SIGFOX_RF_PROTOCOL_API_test_mode(rc, tm);
  }

  /*run command*/
  if (sfx_error != SFX_ERR_NONE)
  {
    if (sfx_error == SFX_ERR_INT_GET_RECEIVED_FRAMES_TIMEOUT)
    {
      at_status = AT_RX_TIMEOUT;
    }
    else
    {
      APP_LOG(TS_OFF, VLEVEL_L, "ERROR 0x%02X", sfx_error);
      at_status = AT_ERROR;
    }
  }
  /*restore config*/
  E2P_Write_Rc(rc_enum_restore);

  E2P_Read_ConfigWords(rc_enum_restore, config_words_restore);

  if (SIGFOX_reopen_and_reconf(rc_enum_restore, config_words_restore) != SFX_ERR_NONE)
  {
    at_status = AT_RECONF_ERROR;
  }
  return at_status;
  /* USER CODE BEGIN AT_test_mode_2 */

  /* USER CODE END AT_test_mode_2 */
}

ATEerror_t AT_power_set(const char *param)
{
  /* USER CODE BEGIN AT_power_set_1 */

  /* USER CODE END AT_power_set_1 */
  int8_t power;

  if (tiny_sscanf(param, "%hhd", &power) != 1)
  {
    return AT_PARAM_ERROR;
  }
  E2P_Write_Power(E2P_Read_Rc(), power);

  return AT_OK;
  /* USER CODE BEGIN AT_power_set_2 */

  /* USER CODE END AT_power_set_2 */
}

ATEerror_t AT_power_get(const char *param)
{
  /* USER CODE BEGIN AT_power_get_1 */

  /* USER CODE END AT_power_get_1 */
  AT_PRINTF("%d\r\n", E2P_Read_Power(E2P_Read_Rc()));

  return AT_OK;
  /* USER CODE BEGIN AT_power_get_2 */

  /* USER CODE END AT_power_get_2 */
}

ATEerror_t AT_outOfBand_run(const char *param)
{
  /* USER CODE BEGIN AT_outOfBand_run_1 */

  /* USER CODE END AT_outOfBand_run_1 */
  SIGFOX_API_send_outofband(SFX_OOB_SERVICE);

  return AT_OK;
  /* USER CODE BEGIN AT_outOfBand_run_2 */

  /* USER CODE END AT_outOfBand_run_2 */
}

ATEerror_t AT_ChannelConfigFcc_set(const char *param)
{
  /* USER CODE BEGIN AT_ChannelConfigFcc_set_1 */

  /* USER CODE END AT_ChannelConfigFcc_set_1 */
  sfx_u32 config_words[3] = {0};
  sfx_u16 timer_state;
  int32_t i;
  int32_t j;
  uint8_t nibble;
  sfx_rc_enum_t sfx_rc = E2P_Read_Rc();

  /* can change the value only in SFX_FH */
  if ((sfx_rc != SFX_RC2) && (sfx_rc != SFX_RC4))
  {
    return AT_PARAM_ERROR;
  }

  for (i = 0, j = (2 * 32 + 28); i < 24; i++, j -= 4)
  {
    nibble = Char2Nibble(*param++);
    if (nibble < 16)
    {
      config_words[i / 8] |= (nibble << (j % 32));
    }
    else
    {
      return AT_PARAM_ERROR;
    }
  }

  if (tiny_sscanf(param, ",%hu", &timer_state) != 1)
  {
    return AT_PARAM_ERROR;
  }

  E2P_Write_ConfigWords(sfx_rc, config_words);

  if (sfx_rc == SFX_RC2)
  {
    sfx_rc_t rc = RC2;

    if ((SIGFOX_API_close()) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
    if ((SIGFOX_API_open(&rc)) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
    if (SIGFOX_API_set_std_config(config_words, (sfx_bool) timer_state) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
  }

  if (sfx_rc == SFX_RC4)
  {
    sfx_rc_t rc = RC4;

    if ((SIGFOX_API_close()) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
    if ((SIGFOX_API_open(&rc)) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
    if (SIGFOX_API_set_std_config(config_words, (sfx_bool) timer_state) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
  }

  return AT_OK;
  /* USER CODE BEGIN AT_ChannelConfigFcc_set_2 */

  /* USER CODE END AT_ChannelConfigFcc_set_2 */
}

ATEerror_t AT_rc_get(const char *param)
{
  /* USER CODE BEGIN AT_rc_get_1 */

  /* USER CODE END AT_rc_get_1 */
  sfx_rc_enum_t sfx_rc = E2P_Read_Rc();

  /*record RCZ*/
  switch (sfx_rc)
  {
    case SFX_RC1:
    {
      AT_PRINTF("1\r\n");
      break;
    }
    case SFX_RC2:
    {
      AT_PRINTF("2\r\n");
      break;
    }
    case SFX_RC3A:
    {
      AT_PRINTF("3A\r\n");
      break;
    }
    case SFX_RC3C:
    {
      AT_PRINTF("3C\r\n");
      break;
    }
    case SFX_RC4:
    {
      AT_PRINTF("4\r\n");
      break;
    }
    case SFX_RC5:
    {
      AT_PRINTF("5\r\n");
      break;
    }
    case SFX_RC6:
    {
      AT_PRINTF("6\r\n");
      break;
    }
    case SFX_RC7:
    {
      AT_PRINTF("7\r\n");
      break;
    }
    default:
      break;
  }
  return AT_OK;
  /* USER CODE BEGIN AT_rc_get_2 */

  /* USER CODE END AT_rc_get_2 */
}

/*AT$RC={1, 2, 3, 4}*/
ATEerror_t AT_rc_set(const char *param)
{
  /* USER CODE BEGIN AT_rc_set_1 */

  /* USER CODE END AT_rc_set_1 */
  /*record RC*/
  if (param[0] == '1' && param[1] == '\0')
  {
    sfx_rc_enum_t SgfxRcId = SFX_RC1;
    sfx_rc_t SgfxRc = RC1;

    E2P_Write_Rc(SgfxRcId);

    if ((SIGFOX_API_close()) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
    if ((SIGFOX_API_open(&SgfxRc)) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
  }
  else if (param[0] == '2' && param[1] == '\0')
  {
    sfx_u32 config_words[3];

    sfx_rc_enum_t SgfxRcId = SFX_RC2;
    sfx_rc_t SgfxRc = RC2;

    E2P_Write_Rc(SgfxRcId);

    E2P_Read_ConfigWords(SgfxRcId, config_words);

    if ((SIGFOX_API_close()) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
    if ((SIGFOX_API_open(&SgfxRc)) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }

    if (SIGFOX_API_set_std_config(config_words, RC2_SET_STD_TIMER_ENABLE) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
  }
  else if (param[0] == '3')
  {
    if (((param[1] == 'a') || (param[1] == 'A')) && (param[2] == '\0'))
    {
      /* RC3C */
      sfx_u32 config_words[3];

      sfx_rc_enum_t SgfxRcId = SFX_RC3A;
      sfx_rc_t SgfxRc = RC3A;

      E2P_Write_Rc(SgfxRcId);

      E2P_Read_ConfigWords(SgfxRcId, config_words);

      if ((SIGFOX_API_close()) != SFX_ERR_NONE)
      {
        return AT_ERROR;
      }
      if ((SIGFOX_API_open(&SgfxRc)) != SFX_ERR_NONE)
      {
        return AT_ERROR;
      }

      if (SIGFOX_API_set_std_config(config_words, NA) != SFX_ERR_NONE)
      {
        return AT_ERROR;
      }
    }
    else  if (((param[1] == 'c') || (param[1] == 'C')) && (param[2] == '\0'))
    {
      /* RC3C */
      sfx_u32 config_words[3];

      sfx_rc_enum_t SgfxRcId = SFX_RC3C;
      sfx_rc_t SgfxRc = RC3C;

      E2P_Write_Rc(SgfxRcId);

      E2P_Read_ConfigWords(SgfxRcId, config_words);

      if ((SIGFOX_API_close()) != SFX_ERR_NONE)
      {
        return AT_ERROR;
      }
      if ((SIGFOX_API_open(&SgfxRc)) != SFX_ERR_NONE)
      {
        return AT_ERROR;
      }

      if (SIGFOX_API_set_std_config(config_words, NA) != SFX_ERR_NONE)
      {
        return AT_ERROR;
      }
    }
    else
    {
      return AT_PARAM_ERROR;
    }
  }
  else if (param[0] == '4' && param[1] == '\0')
  {
    sfx_u32 config_words[3];

    sfx_rc_enum_t SgfxRcId = SFX_RC4;
    sfx_rc_t SgfxRc = RC4;

    E2P_Write_Rc(SgfxRcId);

    E2P_Read_ConfigWords(SgfxRcId, config_words);

    if ((SIGFOX_API_close()) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
    if ((SIGFOX_API_open(&SgfxRc)) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }

    if (SIGFOX_API_set_std_config(config_words, RC4_SET_STD_TIMER_ENABLE) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }

