STMicroelectronics/STM32CubeWL/Projects/NUCLEO-WL55JC/Applications/Sigfox/Sigfox_AT_Slave/Sigfox/App/sgfx_at.c
  }
  else if (param[0] == '5' && param[1] == '\0')
  {
    sfx_u32 config_words[3];

    sfx_rc_enum_t SgfxRcId = SFX_RC5;
    sfx_rc_t SgfxRc = RC5;

    E2P_Write_Rc(SgfxRcId);

    E2P_Read_ConfigWords(SgfxRcId, config_words);

    if ((SIGFOX_API_close()) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
    if ((SIGFOX_API_open(&SgfxRc)) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }

    if (SIGFOX_API_set_std_config(config_words, NA) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
  }
  else  if (param[0] == '6' && param[1] == '\0')
  {
    sfx_rc_enum_t SgfxRcId = SFX_RC6;
    sfx_rc_t SgfxRc = RC6;

    E2P_Write_Rc(SgfxRcId);

    if ((SIGFOX_API_close()) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
    if ((SIGFOX_API_open(&SgfxRc
                        )) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }

  }
  else  if (param[0] == '7' && param[1] == '\0')
  {
    sfx_rc_enum_t SgfxRcId = SFX_RC7;
    sfx_rc_t SgfxRc = RC7;

    E2P_Write_Rc(SgfxRcId);

    if ((SIGFOX_API_close()) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }
    if ((SIGFOX_API_open(&SgfxRc
                        )) != SFX_ERR_NONE)
    {
      return AT_ERROR;
    }

  }
  else
  {
    return AT_PARAM_ERROR;
  }

  return AT_OK;
  /* USER CODE BEGIN AT_rc_set_2 */

  /* USER CODE END AT_rc_set_2 */
}

ATEerror_t AT_rssi_cal_set(const char *param)
{
  /* USER CODE BEGIN AT_rssi_cal_set_1 */

  /* USER CODE END AT_rssi_cal_set_1 */
  int16_t rssi_cal;
  if (tiny_sscanf(param, "%hd", &rssi_cal) != 1)
  {
    return AT_PARAM_ERROR;
  }

  E2P_Write_RssiCal(rssi_cal);

  return AT_OK;
  /* USER CODE BEGIN AT_rssi_cal_set_2 */

  /* USER CODE END AT_rssi_cal_set_2 */
}

ATEerror_t AT_rssi_cal_get(const char *param)
{
  /* USER CODE BEGIN AT_rssi_cal_get_1 */

  /* USER CODE END AT_rssi_cal_get_1 */
  int16_t rssi_cal =  E2P_Read_RssiCal();
  AT_PRINTF("%d dB\r\n", rssi_cal);

  return AT_OK;
  /* USER CODE BEGIN AT_rssi_cal_get_2 */

  /* USER CODE END AT_rssi_cal_get_2 */
}

ATEerror_t AT_echo_set(const char *param)
{
  /* USER CODE BEGIN AT_echo_set_1 */

  /* USER CODE END AT_echo_set_1 */
  uint32_t echoState;
  if (tiny_sscanf(param, "%u", &echoState) != 1)
  {
    return AT_PARAM_ERROR;
  }

  if (echoState == 0)
  {
    E2P_Write_AtEcho(echoState);
  }
  else if (echoState == 1)
  {
    E2P_Write_AtEcho(echoState);
  }
  else
  {
    return AT_PARAM_ERROR;
  }
  return AT_OK;
  /* USER CODE BEGIN AT_echo_set_2 */

  /* USER CODE END AT_echo_set_2 */
}

ATEerror_t AT_echo_get(const char *param)
{
  /* USER CODE BEGIN AT_echo_get_1 */

  /* USER CODE END AT_echo_get_1 */
  uint32_t echoState = E2P_Read_AtEcho();

  AT_PRINTF("%d\r\n", echoState);
  return AT_OK;
  /* USER CODE BEGIN AT_echo_get_2 */

  /* USER CODE END AT_echo_get_2 */
}

ATEerror_t AT_verbose_set(const char *param)
{
  /* USER CODE BEGIN AT_verbose_set_1 */

  /* USER CODE END AT_verbose_set_1 */
  const char *buf = param;
  int32_t lvl_nb;

  /* read and set the verbose level */
  if (1 != tiny_sscanf(buf, "%u", &lvl_nb))
  {
    AT_PRINTF("AT+VL: verbose level is not well set");
    return AT_PARAM_ERROR;
  }
  if ((lvl_nb > VLEVEL_H) || (lvl_nb < VLEVEL_OFF))
  {
    AT_PRINTF("AT+VL: verbose level out of range => 0(VLEVEL_OFF) to 3(VLEVEL_H)");
    return AT_PARAM_ERROR;
  }

  UTIL_ADV_TRACE_SetVerboseLevel(lvl_nb);
  /*write in eeprom*/
  E2P_Write_VerboseLevel(lvl_nb);

  return AT_OK;
  /* USER CODE BEGIN AT_verbose_set_2 */

  /* USER CODE END AT_verbose_set_2 */
}

ATEerror_t AT_verbose_get(const char *param)
{
  /* USER CODE BEGIN AT_verbose_get_1 */

  /* USER CODE END AT_verbose_get_1 */
  print_u(UTIL_ADV_TRACE_GetVerboseLevel());

  return AT_OK;
  /* USER CODE BEGIN AT_verbose_get_2 */

  /* USER CODE END AT_verbose_get_2 */
}

/* USER CODE BEGIN EF */

/* USER CODE END EF */

/* Private Functions Definition -----------------------------------------------*/

static void print_rx(uint8_t *pt, uint32_t n)
{
  /* USER CODE BEGIN print_rx_1 */

  /* USER CODE END print_rx_1 */
  AT_PRINTF("\r\n+RX=");
  for (int32_t i = 0; i < n; i++)
  {
    AT_PRINTF("%c", pt[i]);
  }
  AT_PRINTF("\r\n");
  /* USER CODE BEGIN print_rx_2 */

  /* USER CODE END print_rx_2 */
}

static void print_n(uint8_t *pt, uint32_t n)
{
  /* USER CODE BEGIN print_n_1 */

  /* USER CODE END print_n_1 */
  for (int32_t i = 0; i < n; i++)
  {
    AT_PRINTF("%c", pt[i]);
  }
  /* USER CODE BEGIN print_n_2 */

  /* USER CODE END print_n_2 */
}

static void print_u(uint32_t value)
{
  /* USER CODE BEGIN print_u_1 */

  /* USER CODE END print_u_1 */
  AT_PRINTF("%u\r\n", value);
  /* USER CODE BEGIN print_u_2 */

  /* USER CODE END print_u_2 */
}

static ErrorStatus stringToData(const char *str, uint8_t *data, uint32_t *dataSize)
{
  /* USER CODE BEGIN stringToData_1 */

  /* USER CODE END stringToData_1 */
  uint8_t ii = 0;
  char hex[3];
  hex[2] = 0;
  while ((*str != '\0') && (*str != ','))
  {
    hex[0] = *str++;
    hex[1] = *str++;

    /*check if input is hex */
    if ((isHex(hex[0]) == ERROR) || (isHex(hex[1]) == ERROR))
    {
      return ERROR;
    }
    /*check if input is even nb of character*/
    if ((hex[1] == '\0') || (hex[1] == ','))
    {
      return ERROR;
    }
    if (tiny_sscanf(hex, "%hhx", &data[ii]) != 1)
    {
      return ERROR;
    }
    ii++;
    if (ii > SGFX_MAX_UL_PAYLOAD_SIZE)
    {
      return ERROR;
    }
  }
  *dataSize = ii;
  if (ii == 0)
  {
    return ERROR;
  }
  return SUCCESS;
  /* USER CODE BEGIN stringToData_2 */

  /* USER CODE END stringToData_2 */
}

static ErrorStatus isHex(char Char)
{
  /* USER CODE BEGIN isHex_1 */

  /* USER CODE END isHex_1 */
  if (((Char >= '0') && (Char <= '9')) ||
      ((Char >= 'a') && (Char <= 'f')) ||
      ((Char >= 'A') && (Char <= 'F')))
  {
    return SUCCESS;
  }
  else
  {
    return ERROR;
  }
  /* USER CODE BEGIN isHex_2 */

  /* USER CODE END isHex_2 */
}

static uint8_t Char2Nibble(char Char)
{
  /* USER CODE BEGIN Char2Nibble_1 */

  /* USER CODE END Char2Nibble_1 */
  if (((Char >= '0') && (Char <= '9')))
  {
    return Char - '0';
  }
  else if (((Char >= 'a') && (Char <= 'f')))
  {
    return Char - 'a' + 10;
  }
  else if ((Char >= 'A') && (Char <= 'F'))
  {
    return Char - 'A' + 10;
  }
  else
  {
    return 0xF0;
  }
  /* USER CODE BEGIN Char2Nibble_2 */

  /* USER CODE END Char2Nibble_2 */
}

static sfx_error_t SIGFOX_reopen_and_reconf(sfx_rc_enum_t sfx_rc,  sfx_u32 *config_words)
{
  /* USER CODE BEGIN SIGFOX_reopen_and_reconf_1 */

  /* USER CODE END SIGFOX_reopen_and_reconf_1 */
  sfx_error_t error = SFX_ERR_NONE;

  /*record RCZ*/
  switch (sfx_rc)
  {
    case SFX_RC1:
    {
      sfx_rc_t SgfxRc = RC1;
      error = SIGFOX_API_open(&SgfxRc);
      break;
    }
    case SFX_RC2:
    {
      sfx_rc_t SgfxRc = RC2;

      error = SIGFOX_API_open(&SgfxRc);

      if (error == SFX_ERR_NONE)
      {
        error = SIGFOX_API_set_std_config(config_words, RC2_SET_STD_TIMER_ENABLE);
      }

      break;
    }
    case SFX_RC3A:
    {
      sfx_rc_t SgfxRc = RC3A;

      error = SIGFOX_API_open(&SgfxRc);

      if (error == SFX_ERR_NONE)
      {
        error = SIGFOX_API_set_std_config(config_words, NA);
      }

      break;
    }
    case SFX_RC3C:
    {
      sfx_rc_t SgfxRc = RC3C;

      error = SIGFOX_API_open(&SgfxRc);

      if (error == SFX_ERR_NONE)
      {
        error = SIGFOX_API_set_std_config(config_words, NA);
      }

      break;
    }
    case SFX_RC4:
    {
      sfx_rc_t SgfxRc = RC4;

      error = SIGFOX_API_open(&SgfxRc);

      if (error == SFX_ERR_NONE)
      {
        error = SIGFOX_API_set_std_config(config_words, RC4_SET_STD_TIMER_ENABLE);
      }

      break;
    }
    case SFX_RC5:
    {
      sfx_rc_t SgfxRc = RC5;

      error = SIGFOX_API_open(&SgfxRc);

      if (error == SFX_ERR_NONE)
      {
        error = SIGFOX_API_set_std_config(config_words, NA);
      }

      break;
    }
    case SFX_RC6:
    {
      sfx_rc_t SgfxRc = RC6;

      error = SIGFOX_API_open(&SgfxRc);

      break;
    }
    case SFX_RC7:
    {
      sfx_rc_t SgfxRc = RC7;

      error = SIGFOX_API_open(&SgfxRc);

      break;
    }
    default:
    {
      error = SFX_ERR_API_OPEN;
      break;
    }
  }
  return error;
  /* USER CODE BEGIN SIGFOX_reopen_and_reconf_2 */

  /* USER CODE END SIGFOX_reopen_and_reconf_2 */
}

static sfx_error_t testmode_12(sfx_rc_enum_t rc_enum)
{
  /* USER CODE BEGIN testmode_12_1 */

  /* USER CODE END testmode_12_1 */
  sfx_error_t sfx_err = SFX_ERR_NONE;

  sfx_u8 test_data[1];

  sfx_key_type_t key = E2P_Read_KeyType();

  test_data[0] = 0xAB;

  sfx_u32 config_words[3] = {0};

  E2P_Read_ConfigWords(rc_enum, config_words);

  /*open for test mode 12 with right rc_enum and conf*/
  sfx_err = SIGFOX_reopen_and_reconf(rc_enum, config_words);

  /* Switch public key ON */
  E2P_Write_KeyType(CREDENTIALS_KEY_PUBLIC);

  /* Only call SIGFOX_API_send_xxx */
  sfx_err = SIGFOX_API_send_frame(test_data, 1 /* size of the test data */, (sfx_u8 *)SFX_NULL, 2, SFX_FALSE);

  /* Switch back key type */
  E2P_Write_KeyType(key);

  /* Close the lib before return */
  SIGFOX_API_close();

  return sfx_err;
  /* USER CODE BEGIN testmode_12_2 */

  /* USER CODE END testmode_12_2 */
}

/* USER CODE BEGIN PrFD */

/* USER CODE END PrFD */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
